БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПлановыеСтатьиЗатратИДоходов</Name>
			<Comment>Бюджетирование грузоперевозок</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_Грузоперевозки</xr:Item>
				<xr:Item>Catalog.CW_ВариантыБюджетовПоЗаявкам</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВерсииБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатьиПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыСтатейПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаКурсаДляПроверки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОтраженияРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма без НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Comment>Сумма, включая НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсегоРуб</Name>
					<Comment>Сумма, включая НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС, в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДСРуб</Name>
					<Comment>Сумма НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРуб</Name>
					<Comment>Сумма без НДС, в рублях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаРуб</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКурсаВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПрогноза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКонтрольнаяДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогнозКоличествоДнейПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыНаценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРаспределенияСуммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДСВСебестоимости</Name>
					<Comment>Учитывать НДСВСебестоимости</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПрогнозОплатыПлановыхСтатейБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПрогнозОплатыПлановыхСтатейБюджета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрогнозДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыСтатейПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыСтатейПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПлановыеСтатьиЗатратИДоходов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	мТмп = _сф.ст_ПолучитьСвойство(Параметры.ЗначенияЗаполнения,"ТолькоПросмотр");
	мТмп = ?(мТмп = Неопределено,Ложь,мТмп);
	мТмп2 = _сф.ст_ПолучитьСвойство(Параметры,"ТолькоПросмотр");
	мТмп2 = ?(мТмп2 = Неопределено,Ложь,мТмп2);
	ЭтаФорма.ТолькоПросмотр = (мТмп ИЛИ мТмп2); 
	
	ВРУ = CW_Настройки.ВалютаРегламентированногоУчета(); 
	
	ИспользованиеСхемыПеревыставленияПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");

	//Подсистема.ОграничениеСпискаУслуг
	Массив = новый Массив;
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
	Массив.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
	//Подсистема.ОграничениеСпискаУслуг
	
	Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
		//Подсистема.ОграничениеСпискаУслуг
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"));
		Массив.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
		//Подсистема.ОграничениеСпискаУслуг
		
		Элементы.ПорядокОтраженияРасходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
		Элементы.ПорядокОтраженияДоходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
	КонецЕсли; 
	
	//Подсистема.ОграничениеСпискаУслуг
	МассивПеревыставлений = Новый ФиксированныйМассив(Массив);
	//Подсистема.ОграничениеСпискаУслуг
	
	УказыватьДоговор = ПолучитьФункциональнуюОпцию("CW_УказыватьДоговорДляПлановыхСтатейБюджета");
	ПоказатьПриложениеКДоговору = Ложь;
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ПараметрОпции = Новый Структура("CW_ДоговорПоГрузоперевозкам", Объект.Договор);
		ПоказатьПриложениеКДоговору = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам", ПараметрОпции);
	КонецЕсли;
	
	Элементы.Договор.Видимость = УказыватьДоговор;
	Элементы.ПриложениеКДоговору.Видимость = УказыватьДоговор и ПоказатьПриложениеКДоговору; 
	
	Элементы.ПорядокОтраженияРасходов.Видимость = Ложь;
	Элементы.ПорядокОтраженияДоходов.Видимость = Ложь;
	
	// строка заголовка
	Если Объект.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Доходы Тогда 
		
		стр = "Плановый доход";
		Элементы.ГруппаСтатья.Заголовок = "Доход";
		Элементы.Контрагент.Заголовок = "Клиент";
		Элементы.ПорядокОтраженияДоходов.Видимость = Истина;
		
		НовыеПараметры = Новый Массив;
		НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем")));
		Элементы.Договор.ПараметрыВыбора =  Новый ФиксированныйМассив(НовыеПараметры);
		
	ИначеЕсли Объект.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы Тогда  
		
		стр = "Плановая затрата";
		Элементы.ГруппаСтатья.Заголовок = "Затрата";
		Элементы.Контрагент.Заголовок = "Поставщик";
		Элементы.ПорядокОтраженияРасходов.Видимость = Истина;
		
		НовыеПараметры = Новый Массив;
		НовыеПараметры.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")));
		Элементы.Договор.ПараметрыВыбора =  Новый ФиксированныйМассив(НовыеПараметры);
	
	Иначе 
		
		стр = "НЕ ОПРЕДЕЛЕН ВИД СТАТЬИ ПЛАНИРОВАНИЯ!";
		
	КонецЕсли;
	
	// заголовок формы
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда  
		Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда
			// заявка
			Заголовок = Стр + ". Вариант бюджета: " + Объект.Владелец;	
		Иначе
			// грузоперевозка
			Заголовок = Стр + ". Версия бюджета: " + Объект.ВерсияБюджета;	
		КонецЕсли;
	Иначе
		Заголовок = стр + " НЕ ОПРЕДЕЛЕН ВЛАДЕЛЕЦ СТАТЬИ!";
	КонецЕсли;
	
	УстановитьДатуВладельца();
	
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ВалютаБюджета = Справочники.CW_ТипыПеревозок.ПолучитьВалютуДатуКурсаБюджета(Объект.Владелец.ТипПеревозки, Объект.ВидСтатьиПланирования); 
		Если ВалютаБюджета <> Неопределено Тогда
			СтруктураВалютаБюджета = новый ФиксированнаяСтруктура(ВалютаБюджета); 
		КонецЕсли;
	КонецЕсли; 
	
	// заполнение данных нового элемента
	Если Объект.Ссылка.Пустая() Тогда 
		
		// читаем настройки
		Объект.Организация 	= CW_Настройки.ОсновнаяОрганизация();
		Объект.ЦенаСНДС = CW_Настройки.ПолучитьНастройкуПользователя(, "ЦенаСНДС" + Объект.ВидСтатьиПланирования);
		
		ТипДвижения = "ДОХОДЫ";
		Если Объект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы") Тогда
			ТипДвижения = "РАСХОДЫ";
		КонецЕсли;
	                                
		ПараметрыСтавкиНДС = Новый Структура;
		ПараметрыСтавкиНДС.Вставить("Дата", 		ДатаВладельца);
		ПараметрыСтавкиНДС.Вставить("Организация", 	Объект.Организация);
		ПараметрыСтавкиНДС.Вставить("Номенклатура", Объект.Номенклатура);
		ПараметрыСтавкиНДС.Вставить("Договор", 		Объект.Договор); 
		ПараметрыСтавкиНДС.Вставить("ПодставлятьСтавкуНДС",  CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ПодставлятьСтавкуНДС"));
		ПараметрыСтавкиНДС.Вставить("ТипДвижения",  ТипДвижения);
		
		Объект.СтавкаНДС = CW_Документы.ПолучитьСтавкуНДС(ПараметрыСтавкиНДС);

		ДатаКурсаСтатьи			= ДатаВладельца;
		
		Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			
			Если СтруктураВалютаБюджета <> Неопределено Тогда
				Объект.ТипКурсаВалюты = СтруктураВалютаБюджета.ТипКурсаВалюты;
				Если Объект.ТипКурсаВалюты = 2 и ЗначениеЗаполнено(СтруктураВалютаБюджета.ДатаКурса) Тогда 
					
					ДанныеКурса = CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(Объект.Владелец, СтруктураВалютаБюджета.ДатаКурса, ДатаВладельца);
					Объект.КонтрольнаяДатаКурсаДляПроверки 	= СтруктураВалютаБюджета.ДатаКурса; 
					Если ЗначениеЗаполнено(ДанныеКурса.Дата) Тогда
						ДатаКурсаСтатьи = ДанныеКурса.Дата;	
					КонецЕсли; 
					
				КонецЕсли;   
				
				Объект.Валюта =	СтруктураВалютаБюджета.Валюта
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда    
			Объект.Валюта 		= ПолучитьОсновнуюВалюту(); 
		КонецЕсли;
		
		СтруктураКурса  	= CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта, ДатаКурсаСтатьи); 	
		Объект.Курс 		= СтруктураКурса.Курс;
		Объект.Кратность 	= СтруктураКурса.Кратность;  
		
		// установка опции учета НДС в себестоимости
		ОрганизацияПриИзмененииНаСервере();		
	КонецЕсли; 
	
	// определяем режим выбора контрагентов
	Если (Константы.CW_ОграничиватьВыборКонтрагентовПоБюджету.Получить()) Тогда
		
		Если ТипЗНЧ(Объект.Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
			Если Объект.Владелец.Заказ.Пустая()  Тогда
				ТаблицаКонтрагентов = Объект.Владелец.КонтрагентыПоБюджету.Выгрузить();
			Иначе
				ТаблицаКонтрагентов = Объект.Владелец.Заказ.КонтрагентыПоБюджету.Выгрузить();
			КонецЕсли; 
			
			МассивКонтрагентов = ТаблицаКонтрагентов.ВыгрузитьКолонку("Контрагент");
			
			Если Параметры.ЗначенияЗаполнения.Свойство("Контрагент") Тогда
				Если МассивКонтрагентов.Найти(Параметры.ЗначенияЗаполнения.Контрагент) = Неопределено Тогда
					//Добавляем переданного в параметрах контрагента
					МассивКонтрагентов.Добавить(Параметры.ЗначенияЗаполнения.Контрагент);
				КонецЕсли;
			КонецЕсли;

			Элементы.Контрагент.СписокВыбора.Очистить();
			Для каждого Элемент Из МассивКонтрагентов Цикл
				
				Элементы.Контрагент.СписокВыбора.Добавить(Элемент);
				
			КонецЦикла; 
			Элементы.Контрагент.РежимВыбораИзСписка = Истина;
		КонецЕсли;
		
	КонецЕсли;       
	
	УстановитьПредставлениеКурса();
	
	//Использование количества
	ИспользованиеКоличестваДляПлановыхСтатей = ПолучитьФункциональнуюОпцию("CW_ИспользованиеКоличестваДляПлановыхСтатей");
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ПолучениеКоличестваУслугИзПараметраГрузоперевозки = ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзПараметраГрузоперевозки");  
		Если Параметры.Ключ.Пустая() Тогда
			Объект.Количество = 1;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ОбновитьКоличество.Видимость = ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки; 
	//Использование количества    
	
	//Прогноз ДДС   
	ИспользуетсяПрогнозированиеДДСПоБюджету = ПолучитьФункциональнуюОпцию("CW_ИспользуетсяПрогнозированиеДДСПоБюджету"); 
	Если ИспользуетсяПрогнозированиеДДСПоБюджету Тогда
		ПрогнозДата = РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ПолучитьПрогнозОплаты(Объект.Ссылка);
		УстановитьПредставлениеПрогнозаДДС();             
	КонецЕсли;
	//Прогноз ДДС  
	
	//Подсистема.ОграничениеСпискаУслуг  
	Если УказыватьДоговор Тогда
		ОграничиватьУслугиПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
		Если ОграничиватьУслугиПоДоговорам Тогда
			НеОграничиватьУслугиПоПеревыставлению 	= Константы.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат.Получить();
		КонецЕсли;                 
		
		УстановитьСписокДоступнойНоменклатуры();  
	КонецЕсли;
	//Подсистема.ОграничениеСпискаУслуг  
	
	УстановитьВидимостьЗначенияНаценки();

	ОбратныйПересчетВДокументах  = CW_Настройки.ПолучитьНастройкуПользователя(,"ОбратныйПересчетВДокументах");
	
	_ПраваДоступа(); 
	
	Элементы.ПорядокРаспределенияСуммы.Видимость = (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам"));
	
	УстановитьОтборДинамическогоСписка();
	
	Элементы.СрокДействия.Видимость = (Объект.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы)
		И (ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам"));
	
	УстановитьВидимостьПриложения();  
	
	// опция "НДС в себестоимости" должна отображаться только для расходых статей
	Элементы.УчитыватьНДСВСебестоимости.Видимость = (Объект.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы);

	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	УстановитьПараметрыДоговора();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЗначенияНаценки()
	
	ЭтоРасходнаяСтатья = (Объект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы"));

	Элементы.ВариантНаценки.Видимость  = ЭтоРасходнаяСтатья;
	Элементы.ЗначениеНаценки.Видимость = ЭтоРасходнаяСтатья И НЕ (Объект.ВариантНаценки = ПредопределенноеЗначение("Перечисление.CW_ВариантыНаценки.Нет"));
	
КонецПроцедуры


&НаСервере
Функция УстановитьДатуВладельца() 
	
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		ДатаВладельца = Объект.Владелец.ДатаСделкиФ;
	КонецЕсли;
	
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда
		ДатаВладельца = Объект.Владелец.Владелец.ДатаОбращения;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступностьКурса();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОЗаписиНового(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Подсистема.ОграничениеСпискаУслуг
	Если ИмяСобытия = "ОбновитьСписокУслугПоПротоколу" Или  ИмяСобытия = "ОбновитьАдресУслугДоговора" Тогда 
		УстановитьСписокДоступнойНоменклатуры();   
	КонецЕсли;
	//Подсистема.ОграничениеСпискаУслуг
	
КонецПроцедуры


#КонецОбласти 

&НаСервере
Процедура _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеБюджетов");
	Если НЕ ПравоРедактирования Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ФормаЗаписатьИЗакрыть.Видимость = Ложь;
		Элементы.ФормаЗаписать.Видимость = Ложь;
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли; 
	
	Если ПравоРедактирования Тогда
		
		// проверяем права на курс
		ПравоРедактированияКурса = CW_ПраваДоступа.ПравоДоступно("ИзменениеКурсаПланирования");
		Если НЕ ПравоРедактированияКурса Тогда
			Элементы.ПредставлениеКурса.Доступность = Ложь;
			Элементы.УстановитьКурс.Доступность = Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Элементы.СтавкаНДС.Доступность =  CW_ПраваДоступа.ПравоДоступно("БюджетированиеРедактированиеСтавкиНДС");
	// --- 
КонецПроцедуры

#Область Контрагент 

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если (НЕ Элемент.РежимВыбораИзсписка) Тогда
		
		Если (Объект.ВидСтатьиПланирования=ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы")) Тогда
			_УФК.ВыбратьКлиента(Объект.Контрагент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
		ИначеЕсли (Объект.ВидСтатьиПланирования=ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы")) Тогда 
			_УФК.ВыбратьПоставщика(Объект.Контрагент,Элемент, ДанныеВыбора, СтандартнаяОбработка);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ПодставитьЦенуНоменклатуры(Ложь,Истина);
	ПриИзмененииДоговораНаСервере();

КонецПроцедуры

#КонецОбласти 

#Область СобытияВалюты 

&НаСервере
Функция ПолучитьОсновнуюВалюту()
	
	Возврат(CW_Настройки.ВалютаРегламентированногоУчета());
	
КонецФункции

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда  
		ДатаКурса = ДатаВладельца;
		Объект.КонтрольнаяДатаКурсаДляПроверки = Неопределено; 
		Если Объект.Валюта <> ВРУ Тогда
			Если СтруктураВалютаБюджета <> Неопределено  и ЗначениеЗаполнено(СтруктураВалютаБюджета.ДатаКурса) Тогда
				Объект.КонтрольнаяДатаКурсаДляПроверки = СтруктураВалютаБюджета.ДатаКурса;
			КонецЕсли;                     
			Если  ЗначениеЗаполнено(Объект.КонтрольнаяДатаКурсаДляПроверки) Тогда
				СтруктураКурса 	= CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(Объект.Владелец, Объект.КонтрольнаяДатаКурсаДляПроверки, ДатаВладельца);
				ДатаКурса 		= СтруктураКурса.Дата;
				Объект.ТипКурсаВалюты = 2;
			КонецЕсли;
		КонецЕсли;
		
		_ВалютаПриИзменении(ДатаКурса);   
		
		ДоступностьКурса();   
		
	Иначе
		Объект.ТипКурсаВалюты 	= 0;
		Объект.Курс 			= Неопределено;
		Объект.Кратность		= Неопределено;
		Объект.КонтрольнаяДатаКурсаДляПроверки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура _ВалютаПриИзменении(ДатаКурса)
	
	СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта, ДатаКурса); 
	
	Объект.Курс 		= СтруктураКурса.Курс;
	Объект.Кратность 	= СтруктураКурса.Кратность;

	_КурсПриИзменении();

	УстановитьПредставлениеКурса();

	УстановитьЦенуНоменклатуры();
	
КонецПроцедуры

#КонецОбласти 

#Область СобытияКурса 

&НаКлиенте
Процедура ДоступностьКурса()
	
	Элементы.ГруппаПредставлениеКурса.Видимость = ?(Объект.Валюта = ВРУ, Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Процедура _КурсПриИзменении()
	
	ПересчетСуммНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКурс(Команда)
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда   
		Если Объект.ТипКурсаВалюты = 2 Тогда
			ДатаКурсаСтатьи = CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(Объект.Владелец, Объект.КонтрольнаяДатаКурсаДляПроверки, ДатаВладельца);
			_ВалютаПриИзменении(ДатаКурсаСтатьи.Дата);
		ИначеЕсли Объект.ТипКурсаВалюты = 0 Тогда
			_ВалютаПриИзменении(ДатаВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
 

#КонецОбласти 

#Область СобытияНоменклатуры 

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)  
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда 
		_НоменклатураПриИзменении();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _НоменклатураПриИзменении()
	
	Объект.ЕдиницаИзмерения = Объект.Номенклатура.ЕдиницаИзмерения; 
	
	УстановитьЦенуНоменклатуры();
	
	//Подсистема.ОграничениеСпискаУслуг 
	Если ИспользуетсяОгранчиениеУслуг Тогда 
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
		СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, Ложь);
		СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, Ложь);
		
		СтруктураПараметров.Вставить("Номенклатура"								, Объект.Номенклатура);
		
		УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);	
		
		Если УслугаДоговора <> Неопределено Тогда 
			
			Объект.СтавкаНДС	= УслугаДоговора.СтавкаНДС; 
			Объект.Количество = ?(Объект.Количество = 0,1,Объект.Количество);
			
			Если Объект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
				Объект.ПорядокОтраженияДоходов	= УслугаДоговора.ПорядокОтражения;                                                             
			ИначеЕсли Объект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы") Тогда
				Объект.ПорядокОтраженияРасходов	= УслугаДоговора.ПорядокОтражения;                                                             
			КонецЕсли;   
			
			Если УслугаДоговора.ВариантРасчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыРасчетаНДС.НДСВСумме") Тогда  
				
				Объект.СуммаВсего = УслугаДоговора.Цена * Объект.Количество;  
				СуммаВсегоПриИзмененииНаСервере();
			Иначе
				Объект.Цена = УслугаДоговора.Цена;  
				ЦенаПриИзмененииНаСервере()	
			КонецЕсли;
			
		КонецЕсли;	
		
	// ограничение списка услуг не используется
	Иначе
		ПодставлятьСтавку = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ПодставлятьСтавкуНДС");  
		Если ПодставлятьСтавку Тогда  
			Объект.СтавкаНДС =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(Объект.Номенклатура, ДатаВладельца);
		Иначе
			ТипДвижения = "ДОХОДЫ";
			Если Объект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы") Тогда
				ТипДвижения = "РАСХОДЫ";
			КонецЕсли;
			
			ПараметрыСтавкиНДС = Новый Структура;
			ПараметрыСтавкиНДС.Вставить("Дата", 		ДатаВладельца);
			ПараметрыСтавкиНДС.Вставить("Организация", 	Объект.Организация);
			ПараметрыСтавкиНДС.Вставить("Номенклатура", Объект.Номенклатура);
			ПараметрыСтавкиНДС.Вставить("Договор", 		Объект.Договор);
			ПараметрыСтавкиНДС.Вставить("ПодставлятьСтавкуНДС",  CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"ПодставлятьСтавкуНДС"));
			ПараметрыСтавкиНДС.Вставить("ТипДвижения",  ТипДвижения);
			
			Объект.СтавкаНДС = CW_Документы.ПолучитьСтавкуНДС(ПараметрыСтавкиНДС);
		КонецЕсли; // подставлять ставку НДС из номенклатуры
	КонецЕсли;
	//Подсистема.ОграничениеСпискаУслуг   
	
	
	ПересчетСуммНаСервере();   

	Если ИспользованиеКоличестваДляПлановыхСтатей и ПолучениеКоличестваУслугИзПараметраГрузоперевозки Тогда 
		ОбновитьКоличествоНаСервере();
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьЦенуНоменклатуры() 
	
	Если ТипЗнч(ПараметрыДоговора) <> тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;
	
	ТипЦен = Неопределено;
	ПараметрыДоговора.Свойство("ТипЦен", ТипЦен);  
	Если Не ЗначениеЗаполнено(ТипЦен) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&ДатаСреза,
	               |			Номенклатура = &Номенклатура
	               |				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Валюта = &Валюта";  
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ТекущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", 	Объект.Номенклатура);
 	Запрос.УстановитьПараметр("ТипЦен", 		ТипЦен); 
 	Запрос.УстановитьПараметр("Валюта", 		Объект.Валюта); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.Цена 		= Выборка.Цена;	
		Объект.Количество 	= 1;
		Объект.Сумма   		= Объект.Цена * Объект.Количество;
		ЦенаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры
	

#КонецОбласти 

#Область СобытияСумм 

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	ПересчетСуммНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	СуммаНДСПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент) 
	
	КоличествоПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ЦенаПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ПересчетСуммНаСервере()
	Если ОбратныйПересчетВДокументах Тогда
		СуммаВсегоПриИзмененииНаСервере();
	Иначе 
		СуммаПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаВсегоПриИзменении(Элемент)
	СуммаВсегоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СуммаВсегоПриИзмененииНаСервере() 
	
	CW_Бюджетирование.ПриИзмененииСуммыВсегоСтатьиБюджета(Объект);
	
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзмененииНаСервере()    
	
	CW_Бюджетирование.ПриИзмененииСуммыСтатьиБюджета(Объект);
	
КонецПроцедуры

&НаСервере
Процедура СуммаНДСПриИзмененииНаСервере()  
	
	CW_Бюджетирование.ПриИзмененииСуммыНДССтатьиБюджета(Объект);
	
КонецПроцедуры   

&НаКлиенте
Процедура УчитыватьНДСВСебестоимостиПриИзменении(Элемент)
	УчитыватьНДСВСебестоимостиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УчитыватьНДСВСебестоимостиПриИзмененииНаСервере() 
	
	СуммаВсегоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КоличествоПриИзмененииНаСервере()
	
	ЦенаПриИзмененииНаСервере();
	
КонецПроцедуры    

&НаСервере
Процедура ЦенаПриИзмененииНаСервере()
	
	CW_Бюджетирование.ПриИзмененииЦеныСтатьиБюджета(Объект);
	
КонецПроцедуры    

#КонецОбласти 

&НаСервере
Процедура ЦенаСНДСПриИзмененииНаСервере()
	СуммаНДСПриИзмененииНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаСНДСПриИзменении(Элемент)
	ЦенаСНДСПриИзмененииНаСервере();
КонецПроцедуры  


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры   

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если (Объект.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы) Тогда
			Если (Объект.ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) или (Объект.ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы) Тогда
				Объект.УчитыватьНДСВСебестоимости = CW_Настройки.ПараметрУчетнойПолитики(ДатаВладельца, Объект.Организация, "УчитыватьНДСВСебестоимости");
			Иначе
				Объект.УчитыватьНДСВСебестоимости = Ложь;
			КонецЕсли; 
			УчитыватьНДСВСебестоимостиПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры   


&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ПриИзмененииДоговораНаСервере();
	ДоступностьКурса();  
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДоговораНаСервере()

	//Подсистема.ОграничениеСпискаУслуг
	УстановитьСписокДоступнойНоменклатуры();
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.Валюта 		= Объект.Договор.ВалютаДоговора;
		Объект.Организация 	= Объект.Договор.Организация;  
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда  
		ДатаКурса = ДатаВладельца;
		Объект.КонтрольнаяДатаКурсаДляПроверки = Неопределено; 
		Если Объект.Валюта <> ВРУ Тогда
			Если СтруктураВалютаБюджета <> Неопределено и ЗначениеЗаполнено(СтруктураВалютаБюджета.ДатаКурса) Тогда
				Объект.КонтрольнаяДатаКурсаДляПроверки = СтруктураВалютаБюджета.ДатаКурса;
			КонецЕсли;                     
			Если  ЗначениеЗаполнено(Объект.КонтрольнаяДатаКурсаДляПроверки) Тогда
				СтруктураКурса 	= CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(Объект.Владелец, Объект.КонтрольнаяДатаКурсаДляПроверки, ДатаВладельца);
				ДатаКурса 		= СтруктураКурса.Дата;
				Объект.ТипКурсаВалюты = 2;
			КонецЕсли;
		КонецЕсли;
		
		_ВалютаПриИзменении(ДатаКурса);   
		
	Иначе
		Объект.ТипКурсаВалюты 	= 0;
		Объект.Курс 			= Неопределено;
		Объект.Кратность		= Неопределено;
		Объект.КонтрольнаяДатаКурсаДляПроверки = Неопределено;
	КонецЕсли;
	
	
	//Элементы.Валюта.Доступность 		= НЕ ЗначениеЗаполнено(Объект.Договор); //доступна всегда. Заявка AFR-240447
	Элементы.Организация.Доступность 	= НЕ ЗначениеЗаполнено(Объект.Договор);
	//Подсистема.ОграничениеСпискаУслуг

	УстановитьВидимостьПриложения();

	УстановитьПараметрыДоговора();
	УстановитьЦенуНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПриложения()
	
	//Подсистема.УчетПриложенийДоговоров
	ВедетсяУчетПриложенийПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	Элементы.ПриложениеКДоговору.Видимость = Объект.Договор.ИспользуютсяПриложения и ВедетсяУчетПриложенийПоДоговорам;
	//Подсистема.УчетПриложенийДоговоров

КонецПроцедуры  


&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент) 
	
	УстановитьПараметрыДоговора();
	УстановитьЦенуНоменклатуры();

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДоговора()

	ПараметрыПроцедуры = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	ПараметрыПроцедуры.Дата 				= ТекущаяДата();
	ПараметрыПроцедуры.Договор 				= Объект.Договор;
	ПараметрыПроцедуры.ПриложениеКДоговору 	= Объект.ПриложениеКДоговору;
	
	ПолученныеПараметры	= CW_Настройки.ПолучитьПараметрыДоговора(ПараметрыПроцедуры);
	
	ПараметрыДоговора = Новый ФиксированнаяСтруктура(ПолученныеПараметры);
	
КонецПроцедуры


//Использование количества в бюджете
&НаКлиенте
Процедура ОбновитьКоличество(Команда)
	ОбновитьКоличествоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТипПеревозки", 		Объект.Владелец.ТипПеревозки);
	СтруктураПараметров.Вставить("Номенклатура", 		Объект.Номенклатура);
	СтруктураПараметров.Вставить("ЕдиницаИзмерения", 	Объект.ЕдиницаИзмерения);

	НайденныйПараметр 	= CW_Документы.ПолучитьПараметрДляПодстановкиЗначенияВКоличество(СтруктураПараметров); 
	Если НайденныйПараметр <> Неопределено Тогда 
		
		СтруктураЗначения = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.ПолучитьЗначениеПараметра(Объект.Владелец, НайденныйПараметр);
		Если СтруктураЗначения.Значение <> Неопределено Тогда
			Объект.Количество = СтруктураЗначения.Значение; 
			КоличествоПриИзмененииНаСервере();  
		КонецЕсли;  
		
	КонецЕсли;

КонецПроцедуры
//Использование количества в бюджете


&НаКлиенте
Процедура ПредставлениеКурсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораКурса",ЭтотОбъект);  
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецСтатьи", 	Объект.Владелец);
	ПараметрыФормы.Вставить("ТипКурсаВалюты", 	Объект.ТипКурсаВалюты);
	ПараметрыФормы.Вставить("Курс", 			Объект.Курс);
	ПараметрыФормы.Вставить("Кратность", 		Объект.Кратность);   
	ПараметрыФормы.Вставить("КонтрольнаяДата",  Объект.КонтрольнаяДатаКурсаДляПроверки); 
	
	ПараметрыФормы.Вставить("ВариантПоДате",  	Объект.Валюта <> ВРУ); 
	
	
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаВыбораКурсаВалюты", ПараметрыФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКурса(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Модифицированность = истина;  
	
	Объект.ТипКурсаВалюты 	= Результат.ТипКурсаВалюты;
	
	Если Результат.ТипКурсаВалюты = 0 Тогда   
		
		СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта, ДатаВладельца); 
		Объект.Курс 		= СтруктураКурса.Курс;
		Объект.Кратность 	= СтруктураКурса.Кратность; 
		Объект.КонтрольнаяДатаКурсаДляПроверки = Неопределено;	
		
	ИначеЕсли Результат.ТипКурсаВалюты = 1 Тогда
		
		Объект.Курс 		= Результат.Курс;
		Объект.Кратность 	= Результат.Кратность;
		Объект.КонтрольнаяДатаКурсаДляПроверки = Неопределено;	
		
	ИначеЕсли Результат.ТипКурсаВалюты = 2 Тогда 

		ДатаКурсаСтатьи 	= CW_Бюджетирование.ПолучитьДатуКурсаПлановойСтатьи(Объект.Владелец, Результат.КонтрольнаяДата, ДатаВладельца);
		СтруктураКурса  	= CW_Финансы.ПолучитьКурсВалюты(Объект.Валюта, ДатаКурсаСтатьи.Дата); 
		
		Объект.КонтрольнаяДатаКурсаДляПроверки 	= Результат.КонтрольнаяДата;	
		Объект.Курс 							= СтруктураКурса.Курс;
		Объект.Кратность 						= СтруктураКурса.Кратность; 
		
	КонецЕсли;
	
	УстановитьПредставлениеКурса();
	
	_КурсПриИзменении();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеКурса() 
	
	СоответствиеТипаКурса = Новый Соответствие;
	СоответствиеТипаКурса.Вставить(0, " (Авто.)");
	СоответствиеТипаКурса.Вставить(1, " (Фикс.)");
	СоответствиеТипаКурса.Вставить(2, " ("+СокрЛП(Объект.КонтрольнаяДатаКурсаДляПроверки)+")"); 
	
	ПредставлениеТипаКурса 	= СоответствиеТипаКурса.Получить(Объект.ТипКурсаВалюты);
	ПредставлениеКурса 		= Формат(Объект.Курс, "ЧДЦ=4; ЧГ=0") + ?(Объект.Кратность > 1, "/"+Формат(Объект.Кратность,"ЧЦ=10; ЧГ="), "") + ПредставлениеТипаКурса;
	
КонецПроцедуры   

   &НаКлиенте
Процедура ПредставлениеКурсаПриИзменении(Элемент)
	УстановитьПредставлениеКурса();
КонецПроцедуры

// Подстановка цен номенлатуры 

&НаКлиенте
Процедура ПодставитьЦену(Команда)
	
	ПодставитьЦенуНоменклатуры(Истина,Ложь);
	
КонецПроцедуры

&НаКлиенте
Функция ПодставитьЦенуНоменклатуры(КонтрольЗаполнения=Истина,КонтрольТекущейЦены=Истина)
	// --- 
	
	//Если (КонтрольТекущейЦены) Тогда
	//	
	//	Если (Объект.СуммаВсего <> 0) Тогда
	//		Возврат(Неопределено);
	//	КонецЕсли; 
	//	
	//КонецЕсли; 
	//
	//Если (НЕ ЗначениеЗаполнено(Объект.Контрагент) 
	//	ИЛИ НЕ ЗначениеЗаполнено(Объект.Валюта)
	//	ИЛИ НЕ ЗначениеЗаполнено(Объект.Номенклатура)) Тогда
	//	
	//	Если (КонтрольЗаполнения) Тогда
	//		_УФК.ВывестиПредупреждение("Не заполнены требуемые реквизиты.");	
	//	КонецЕсли; 
	//	
	//	Возврат(Неопределено);
	//	
	//КонецЕсли; 
	//
	//Ответ = _ПодставитьЦенуНоменклатуры(КонтрольТекущейЦены);
	//Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
	//	
	//	_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
	//	
	//КонецЕсли; 
	
	// --- 
КонецФункции

&НаСервере
Функция _ПодставитьЦенуНоменклатуры(КонтрольТекущейЦены=Истина)
	// --- 
	
	// получаем тип цен
	
	// --- 
КонецФункции
// Подстановка цен номенлатуры 

// Подключаемые_внешние_команды
&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);

КонецПроцедуры
// Подключаемые_внешние_команды


&НаКлиенте
Процедура ВариантНаценкиПриИзменении(Элемент)
	
	УстановитьВидимостьЗначенияНаценки();

КонецПроцедуры


//Прогноз ДДС 
&НаСервере
Процедура УстановитьПредставлениеПрогнозаДДС()
	
	Если ТипЗнч(Объект.Владелец)= Тип("СправочникСсылка.CW_Грузоперевозки") Тогда  
		СтрПрогнозПредставление = Формат(ПрогнозДата, "ДФ=dd.MM.yyyy; ДП=<Отсутствует>");
	ИначеЕсли ТипЗнч(Объект.Владелец)= Тип("СправочникСсылка.CW_ВариантыБюджетовПоЗаявкам") Тогда
		СтрПрогнозПредставление = Формат(Объект.ПрогнозКоличествоДнейПлан, "ЧН=<Отсутствует>; ЧГ=0"); 	
	КонецЕсли;
	
	ПрогнозПредставление = СтрПрогнозПредставление;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПрогнозПредставлениеНажатие(Элемент, СтандартнаяОбработка)  
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец", 			 		Объект.Владелец);
	ПараметрыФормы.Вставить("ВариантПрогноза", 			 	Объект.ВариантПрогноза);
	ПараметрыФормы.Вставить("ПрогнозКонтрольнаяДата", 	 	Объект.ПрогнозКонтрольнаяДата);
	ПараметрыФормы.Вставить("ПрогнозКоличествоДней", 	 	Объект.ПрогнозКоличествоДней);
	ПараметрыФормы.Вставить("ПрогнозКоличествоДнейПлан", 	Объект.ПрогнозКоличествоДнейПлан);
	ПараметрыФормы.Вставить("ПрогнозДата", 					ПрогнозДата);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПрогнозПредставлениеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_ПлановыеСтатьиЗатратИДоходов.Форма.ФормаПрогнозаОплаты", ПараметрыФормы, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры     

&НаКлиенте
Процедура ПрогнозПредставлениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат.Свойство("ВариантПрогноза", 			Объект.ВариантПрогноза);
	Результат.Свойство("ПрогнозКонтрольнаяДата", 	Объект.ПрогнозКонтрольнаяДата);
	Результат.Свойство("ПрогнозКоличествоДней", 	Объект.ПрогнозКоличествоДней);
	Результат.Свойство("ПрогнозКоличествоДнейПлан", Объект.ПрогнозКоличествоДнейПлан);
	Результат.Свойство("ПрогнозДата", 				ПрогнозДата);
	
	Модифицированность = Истина;
	УстановитьПредставлениеПрогнозаДДС();	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьПрогноз(Команда)
	РасчитатьПрогнозНаСервере();
КонецПроцедуры

&НаСервере
Процедура РасчитатьПрогнозНаСервере()
	
	Если ТипЗнч(Объект.Владелец) <> Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПеревозки = Объект.Владелец.ДатаСделкиФ;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ВариантПрогноза", 			Объект.ВариантПрогноза);
	ПараметрыРасчета.Вставить("Владелец", 					Объект.Владелец);
	ПараметрыРасчета.Вставить("ПрогнозКонтрольнаяДата", 	Объект.ПрогнозКонтрольнаяДата);
	ПараметрыРасчета.Вставить("ПрогнозКоличествоДней", 		Объект.ПрогнозКоличествоДней);
	ПараметрыРасчета.Вставить("ПрогнозКоличествоДнейПлан", 	Объект.ПрогнозКоличествоДнейПлан);
	
	ПараметрыРасчета.Вставить("ПрогнозДата",	 			ПрогнозДата);
	ПараметрыРасчета.Вставить("ДатаНачалаПеревозки", 		ДатаНачалаПеревозки);
	
	НовыйПрогнозДата = Справочники.CW_ПлановыеСтатьиЗатратИДоходов.РассчитатьПрогнозОплатыСтатьиБюджета(ПараметрыРасчета); 
	Если НовыйПрогнозДата <> Неопределено 
		И НовыйПрогнозДата <> ПрогнозДата Тогда
		ПрогнозДата = НовыйПрогнозДата;   
		Модифицированность = истина;
		УстановитьПредставлениеПрогнозаДДС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)                                            
	
	Если ИспользуетсяПрогнозированиеДДСПоБюджету 
		и ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.CW_Грузоперевозки") Тогда 
		РасчитатьПрогнозНаСервере();
		РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ЗаписатьПрогнозОплаты(Объект.Ссылка, ПрогнозДата);
		ПрогнозДата = РегистрыСведений.CW_ПрогнозОплатыПлановыхСтатейБюджета.ПолучитьПрогнозОплаты(Объект.Ссылка);
		УстановитьПредставлениеПрогнозаДДС();             
	КонецЕсли;  
	
	УстановитьОтборДинамическогоСписка();
	
КонецПроцедуры
//Прогноз ДДС

//Подсистема.ОграничениеСпискаУслуг 
&НаСервере
Процедура УстановитьСписокДоступнойНоменклатуры()
	
	ИспользуетсяОгранчиениеУслуг = Ложь;
	Если Объект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Расходы") Тогда
		ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(Объект.ПорядокОтраженияРасходов);  
	ИначеЕсли Объект.ВидСтатьиПланирования = ПредопределенноеЗначение("Перечисление.CW_ВидыСтатейПланирования.Доходы") Тогда
		ИспользуетсяОгранчиениеУслуг = ПолучитьОграничениеУслугПоНоменклатуре(Объект.ПорядокОтраженияДоходов); 
	КонецЕсли;
	
	Если ИспользуетсяОгранчиениеУслуг тогда 
		
		АдресУслугПоДоговору = _УФС.ОбновитьСписокУслугПоДоговору(ДатаВладельца, Объект.Договор, ЭтаФорма);   
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			МассивУслуг =  _УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору);
			Элементы.Номенклатура.СписокВыбора.ЗагрузитьЗначения(МассивУслуг); 
		КонецЕсли; 
	КонецЕсли;	
	
	Элементы.Номенклатура.РежимВыбораИзСписка = ИспользуетсяОгранчиениеУслуг;

КонецПроцедуры

&НаСервере
Функция ПолучитьОграничениеУслугПоНоменклатуре(ПорядокОтражения=Неопределено)

	ИспользуетсяОгранчиениеУслуг = Ложь; 
	
	Если ОграничиватьУслугиПоДоговорам Тогда
		ИспользуетсяОгранчиениеУслуг = ?(ЗначениеЗаполнено(Объект.Договор), Объект.Договор.ОграничиватьНоменклатуру, Ложь);
		Если НеОграничиватьУслугиПоПеревыставлению и МассивПеревыставлений.Найти(ПорядокОтражения) <> Неопределено Тогда
			ИспользуетсяОгранчиениеУслуг = Ложь;	
		КонецЕсли;    
	КонецЕсли;
	
	Возврат ИспользуетсяОгранчиениеУслуг;
	
	
КонецФункции

&НаКлиенте
Процедура ПорядокОтраженияПриИзменении(Элемент) 
	Если УказыватьДоговор Тогда
		УстановитьСписокДоступнойНоменклатуры();
	КонецЕсли;  
	
	// в зависимости от указанной организации изменение порядка отражения
	// может влиять на установку признака учета НДС в себестоимости
	ПорядокОтраженияПриИзмененииНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ПорядокОтраженияПриИзмененииНаСервере()  
	
	// для расходных статей с порядком отражения "Затраты" проверяем необходимость установки признака учета НДС в себестоимости
	Если (Объект.ВидСтатьиПланирования = Перечисления.CW_ВидыСтатейПланирования.Расходы) и 
		((Объект.ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты) или (Объект.ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы)) 
	Тогда
		ОрганизацияПриИзмененииНаСервере();	
	Иначе
		Объект.УчитыватьНДСВСебестоимости = Ложь;
		УчитыватьНДСВСебестоимостиПриИзмененииНаСервере();	
	КонецЕсли;
	
КонецПроцедуры


//Подсистема.ОграничениеСпискаУслуг

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокДокументов.ТекущиеДанные;
	ПоказатьЗначение(,ТекущиеДанные.Документ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	
	СписокДокументов.Отбор.Элементы.Очистить();
	
	ЭлементОтбра = СписокДокументов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбра.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СтатьяБюджета");
	ЭлементОтбра.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбра.ПравоеЗначение	= ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	ЭлементОтбра.Использование 	= Истина;  
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	CW_ДоходыПоГрузоперевозкамОбороты.СтатьяБюджета КАК СтатьяБюджета,
	|	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов КАК Документ,
	|	CW_ДоходыПоГрузоперевозкамОбороты.ДокументДоходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	CW_ДоходыПоГрузоперевозкамОбороты.Валюта КАК Валюта,
	|	CW_ДоходыПоГрузоперевозкамОбороты.ВсегоОборот КАК Всего,
	|	CW_ДоходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот КАК ВсегоВал
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам.Обороты(, , Период, СтатьяБюджета = &СтатьяБюджета) КАК CW_ДоходыПоГрузоперевозкамОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CW_РасходыПоГрузоперевозкамОбороты.СтатьяБюджета,
	|	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов,
	|	CW_РасходыПоГрузоперевозкамОбороты.ДокументРасходов.ПредставлениеДокумента,
	|	CW_РасходыПоГрузоперевозкамОбороты.Валюта,
	|	CW_РасходыПоГрузоперевозкамОбороты.ВсегоОборот,
	|	CW_РасходыПоГрузоперевозкамОбороты.Всего_ВалютаОборот
	|ИЗ
	|	РегистрНакопления.CW_РасходыПоГрузоперевозкам.Обороты(, , Период, СтатьяБюджета = &СтатьяБюджета) КАК CW_РасходыПоГрузоперевозкамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Данные.Документ КАК Документ
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные"; 
	
	Запрос.УстановитьПараметр("СтатьяБюджета", ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка)); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоДокументов = Выборка.Количество();
	
КонецПроцедуры
